#ТОКЕНЫ
token = '7382600384:AAHNlWb7wrqs_5zP5qpt-4LdPsQstqSwynU' #Токен бота
api_cryptobot = '404008:AAKPL3OqMTCmI7xgfxYQCNyJytIFYYpLUru' # api CryptoBot

#id каналов/чатов
channal_id = -1002553059639 #id игрового канала (Где происходят игры)
ID_SEND_TRANSFER = -1002011813882 #Канал выплат
URL_LOG_CHANNAL = -1002598489061 #id канала логов


#ОБЩЕЕ
ADMIN = [7304732856, 5003255086] #id Админов, перечислять через запятую
ADMIN_USERNAME = '@pokodil' #@Юзерней админа
URL_BOT = 'https://t.me/eternalbet_bot' #Ссылка на бота
NICNAME = 'eternalbet_bot' #Username бота без @
NAME_CASINO = 'ETERNALBET' #Название вашего казино


#ЛИМИТЫ И ПРОЦЕНТЫ
LIMIT_STAVKA = 1 #Лимит на max ставку
lose_withdraw = 20 #Процент реферальной программы
min_stavka_referal = 1 #Это минимальная сумма ставки для того чтобы получить деньги с реферала
CASHBACK_PROCENT = 10 #Процент кэшбэка от ставки при проигрыше
CASHBACK_LIMIT = 1 #От какой суммы ставки предоставляется кэшбэк
PROCENT_DRAW = 7 #Процент комиссии за ничью
PROCENT_NOT_GAME = 10 #Процент за комиссию при привышении макс ставки или не указания коментария к платежу
TIMER = 67 #Указываем время в секундах в какое n время будет играть фейк ставка когда она будет включена через админ меню, рекомендуемое значение 40 секунд



#Фейк ставки
FAKE_NICKNAME = ['KARL', 'Alina', 'Кто то', 'Лудик', 'Маша', 'M**ks', '😈', 'Панфилов', 'Аркадий', 'Паровозов', 'Евгений', 'Макс [Check Bio]', 'Дориан', 'Карим', 'Алфей', 'zzzzzz', 'Ya Kay💸'] #Фейк ники
DIAPAZONE_AMOUNT = [2.50, 19.50] #Диапозон сумм фейк ставки


#////////////////////////////////Ключевые слова. НЕ ТРОГАТЬ\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
#Кости
Bones = ['Больше', 'Меньше', '1', '2', '3', '4', '5', '6', 'Пвп', 'Ничья', 'Равно', 'Дуэль', '2М', '2Б', '2 Больше', '2 Меньше', 'Чет', 'Нечет']

#Слоты
Slots = ['Слоты']

#Баскетбол
Basketball = ['Баскетбол Гол', 'Баскет Гол', 'Баскетбол Мимо', 'Баскет Мимо']

#Футбол
Fotbool = ['Футбол Гол', 'Фут Гол', 'Футбол Мимо', 'Фут Мимо']

#Камень,Ножницы,Бумага
SU_E_FA = ['Камень', 'Ножницы', 'Бумага']


#Колесо
WHEEL = ['Красное', 'Черное', 'Зеленое']


all_text = ['Больше', 'Меньше', '1', '2', '3', '4', '5', '6', 'Пвп', 'Дуэль', '2М', '2Б', '2 Больше', '2 Меньше', 'Чет', 'Нечет',
            'Слоты', 'Баскетбол Гол', 'Красное', 'Черное', 'Зеленое', 'Баскет Гол', 'Ничья', 'Равно', 'Баскетбол Мимо', 'Баскет Мимо', 'Футбол Гол', 'Фут Гол', 'Футбол Мимо', 'Фут Мимо', 'Камень', 'Ножницы', 'Бумага']

#Красные/Черные/Зеленое
RED = ['1', '2', '3', '4', '5', '6', '7']

BLACK = ['8', '9', '10', '11', '12', '13', '14']

GREEN = '0'

